## Plan Result (prod_app_registrations)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 9 to add, 0 to change, 9 to destroy.</code></pre>

* Create
  * module.this.azurerm_role_assignment.this[&#34;DTS AKS Auto-Shutdown-Contributor-/providers/Microsoft.Management/managementGroups/CFT-NonProd&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS AKS Auto-Shutdown-Contributor-/providers/Microsoft.Management/managementGroups/CFT-Sandbox&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS AKS Auto-Shutdown-Contributor-/providers/Microsoft.Management/managementGroups/Heritage-NonProd&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS AKS Auto-Shutdown-Contributor-/providers/Microsoft.Management/managementGroups/Heritage-Sandbox&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS AKS Auto-Shutdown-Contributor-/providers/Microsoft.Management/managementGroups/Platform-NonProd&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS AKS Auto-Shutdown-Contributor-/providers/Microsoft.Management/managementGroups/Platform-Sandbox&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS AKS Auto-Shutdown-Contributor-/providers/Microsoft.Management/managementGroups/SDS-NonProd&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS AKS Auto-Shutdown-Contributor-/providers/Microsoft.Management/managementGroups/SDS-Sandbox&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS AKS Auto-Shutdown-Contributor-/providers/Microsoft.Management/managementGroups/Security&#34;]
* Delete
  * module.this.azurerm_role_assignment.this[&#34;DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/CFT-NonProd&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/CFT-Sandbox&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/Heritage-NonProd&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/Heritage-Sandbox&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/Platform-NonProd&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/Platform-Sandbox&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/SDS-NonProd&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/SDS-Sandbox&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/Security&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.this.azurerm_role_assignment.this["DTS AKS Auto-Shutdown-Contributor-/providers/Microsoft.Management/managementGroups/CFT-NonProd"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "41b2e9c9-db54-40fa-a7c0-a04a5ea7531e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["DTS AKS Auto-Shutdown-Contributor-/providers/Microsoft.Management/managementGroups/CFT-Sandbox"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "41b2e9c9-db54-40fa-a7c0-a04a5ea7531e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["DTS AKS Auto-Shutdown-Contributor-/providers/Microsoft.Management/managementGroups/Heritage-NonProd"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "41b2e9c9-db54-40fa-a7c0-a04a5ea7531e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["DTS AKS Auto-Shutdown-Contributor-/providers/Microsoft.Management/managementGroups/Heritage-Sandbox"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "41b2e9c9-db54-40fa-a7c0-a04a5ea7531e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["DTS AKS Auto-Shutdown-Contributor-/providers/Microsoft.Management/managementGroups/Platform-NonProd"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "41b2e9c9-db54-40fa-a7c0-a04a5ea7531e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["DTS AKS Auto-Shutdown-Contributor-/providers/Microsoft.Management/managementGroups/Platform-Sandbox"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "41b2e9c9-db54-40fa-a7c0-a04a5ea7531e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["DTS AKS Auto-Shutdown-Contributor-/providers/Microsoft.Management/managementGroups/SDS-NonProd"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "41b2e9c9-db54-40fa-a7c0-a04a5ea7531e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["DTS AKS Auto-Shutdown-Contributor-/providers/Microsoft.Management/managementGroups/SDS-Sandbox"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "41b2e9c9-db54-40fa-a7c0-a04a5ea7531e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["DTS AKS Auto-Shutdown-Contributor-/providers/Microsoft.Management/managementGroups/Security"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "41b2e9c9-db54-40fa-a7c0-a04a5ea7531e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Security"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/CFT-NonProd"] will be destroyed
  # (because key ["DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/CFT-NonProd"] is not in for_each map)
  - resource "azurerm_role_assignment" "this" {
      - id                   = "/providers/Microsoft.Management/managementGroups/CFT-NonProd/providers/Microsoft.Authorization/roleAssignments/e8b97d08-5f55-131d-52b5-47ec3b0e2f95" -> null
      - name                 = "e8b97d08-5f55-131d-52b5-47ec3b0e2f95" -> null
      - principal_id         = "41b2e9c9-db54-40fa-a7c0-a04a5ea7531e" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/providers/Microsoft.Authorization/roleDefinitions/9980e02c-c2be-4d73-94e8-173b1dc7cf3c" -> null
      - role_definition_name = "Virtual Machine Contributor" -> null
      - scope                = "/providers/Microsoft.Management/managementGroups/CFT-NonProd" -> null
    }

  # module.this.azurerm_role_assignment.this["DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/CFT-Sandbox"] will be destroyed
  # (because key ["DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/CFT-Sandbox"] is not in for_each map)
  - resource "azurerm_role_assignment" "this" {
      - id                   = "/providers/Microsoft.Management/managementGroups/CFT-Sandbox/providers/Microsoft.Authorization/roleAssignments/e45e4ca8-08d8-4deb-6ed6-08cb816422a3" -> null
      - name                 = "e45e4ca8-08d8-4deb-6ed6-08cb816422a3" -> null
      - principal_id         = "41b2e9c9-db54-40fa-a7c0-a04a5ea7531e" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/providers/Microsoft.Authorization/roleDefinitions/9980e02c-c2be-4d73-94e8-173b1dc7cf3c" -> null
      - role_definition_name = "Virtual Machine Contributor" -> null
      - scope                = "/providers/Microsoft.Management/managementGroups/CFT-Sandbox" -> null
    }

  # module.this.azurerm_role_assignment.this["DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/Heritage-NonProd"] will be destroyed
  # (because key ["DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/Heritage-NonProd"] is not in for_each map)
  - resource "azurerm_role_assignment" "this" {
      - id                   = "/providers/Microsoft.Management/managementGroups/Heritage-NonProd/providers/Microsoft.Authorization/roleAssignments/fc7c780a-9700-62dd-e4f0-7188350a948e" -> null
      - name                 = "fc7c780a-9700-62dd-e4f0-7188350a948e" -> null
      - principal_id         = "41b2e9c9-db54-40fa-a7c0-a04a5ea7531e" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/providers/Microsoft.Authorization/roleDefinitions/9980e02c-c2be-4d73-94e8-173b1dc7cf3c" -> null
      - role_definition_name = "Virtual Machine Contributor" -> null
      - scope                = "/providers/Microsoft.Management/managementGroups/Heritage-NonProd" -> null
    }

  # module.this.azurerm_role_assignment.this["DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/Heritage-Sandbox"] will be destroyed
  # (because key ["DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/Heritage-Sandbox"] is not in for_each map)
  - resource "azurerm_role_assignment" "this" {
      - id                   = "/providers/Microsoft.Management/managementGroups/Heritage-Sandbox/providers/Microsoft.Authorization/roleAssignments/c4c5b9b1-26ac-0b43-d9cd-407b6f35589b" -> null
      - name                 = "c4c5b9b1-26ac-0b43-d9cd-407b6f35589b" -> null
      - principal_id         = "41b2e9c9-db54-40fa-a7c0-a04a5ea7531e" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/providers/Microsoft.Authorization/roleDefinitions/9980e02c-c2be-4d73-94e8-173b1dc7cf3c" -> null
      - role_definition_name = "Virtual Machine Contributor" -> null
      - scope                = "/providers/Microsoft.Management/managementGroups/Heritage-Sandbox" -> null
    }

  # module.this.azurerm_role_assignment.this["DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/Platform-NonProd"] will be destroyed
  # (because key ["DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/Platform-NonProd"] is not in for_each map)
  - resource "azurerm_role_assignment" "this" {
      - id                   = "/providers/Microsoft.Management/managementGroups/Platform-NonProd/providers/Microsoft.Authorization/roleAssignments/e34f8431-c4bd-445a-4e0f-bae8bdad6854" -> null
      - name                 = "e34f8431-c4bd-445a-4e0f-bae8bdad6854" -> null
      - principal_id         = "41b2e9c9-db54-40fa-a7c0-a04a5ea7531e" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/providers/Microsoft.Authorization/roleDefinitions/9980e02c-c2be-4d73-94e8-173b1dc7cf3c" -> null
      - role_definition_name = "Virtual Machine Contributor" -> null
      - scope                = "/providers/Microsoft.Management/managementGroups/Platform-NonProd" -> null
    }

  # module.this.azurerm_role_assignment.this["DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/Platform-Sandbox"] will be destroyed
  # (because key ["DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/Platform-Sandbox"] is not in for_each map)
  - resource "azurerm_role_assignment" "this" {
      - id                   = "/providers/Microsoft.Management/managementGroups/Platform-Sandbox/providers/Microsoft.Authorization/roleAssignments/2aa80c5e-8191-77f8-05b0-eb93062cafb7" -> null
      - name                 = "2aa80c5e-8191-77f8-05b0-eb93062cafb7" -> null
      - principal_id         = "41b2e9c9-db54-40fa-a7c0-a04a5ea7531e" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/providers/Microsoft.Authorization/roleDefinitions/9980e02c-c2be-4d73-94e8-173b1dc7cf3c" -> null
      - role_definition_name = "Virtual Machine Contributor" -> null
      - scope                = "/providers/Microsoft.Management/managementGroups/Platform-Sandbox" -> null
    }

  # module.this.azurerm_role_assignment.this["DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/SDS-NonProd"] will be destroyed
  # (because key ["DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/SDS-NonProd"] is not in for_each map)
  - resource "azurerm_role_assignment" "this" {
      - id                   = "/providers/Microsoft.Management/managementGroups/SDS-NonProd/providers/Microsoft.Authorization/roleAssignments/3e004f7d-d648-fc45-8747-cfafe734f5df" -> null
      - name                 = "3e004f7d-d648-fc45-8747-cfafe734f5df" -> null
      - principal_id         = "41b2e9c9-db54-40fa-a7c0-a04a5ea7531e" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/providers/Microsoft.Authorization/roleDefinitions/9980e02c-c2be-4d73-94e8-173b1dc7cf3c" -> null
      - role_definition_name = "Virtual Machine Contributor" -> null
      - scope                = "/providers/Microsoft.Management/managementGroups/SDS-NonProd" -> null
    }

  # module.this.azurerm_role_assignment.this["DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/SDS-Sandbox"] will be destroyed
  # (because key ["DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/SDS-Sandbox"] is not in for_each map)
  - resource "azurerm_role_assignment" "this" {
      - id                   = "/providers/Microsoft.Management/managementGroups/SDS-Sandbox/providers/Microsoft.Authorization/roleAssignments/c9e78e1b-e490-eea1-dc23-53ac79ea986c" -> null
      - name                 = "c9e78e1b-e490-eea1-dc23-53ac79ea986c" -> null
      - principal_id         = "41b2e9c9-db54-40fa-a7c0-a04a5ea7531e" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/providers/Microsoft.Authorization/roleDefinitions/9980e02c-c2be-4d73-94e8-173b1dc7cf3c" -> null
      - role_definition_name = "Virtual Machine Contributor" -> null
      - scope                = "/providers/Microsoft.Management/managementGroups/SDS-Sandbox" -> null
    }

  # module.this.azurerm_role_assignment.this["DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/Security"] will be destroyed
  # (because key ["DTS AKS Auto-Shutdown-Virtual Machine Contributor-/providers/Microsoft.Management/managementGroups/Security"] is not in for_each map)
  - resource "azurerm_role_assignment" "this" {
      - id                   = "/providers/Microsoft.Management/managementGroups/Security/providers/Microsoft.Authorization/roleAssignments/079f58e4-350d-dc49-bff8-16c012e4b83c" -> null
      - name                 = "079f58e4-350d-dc49-bff8-16c012e4b83c" -> null
      - principal_id         = "41b2e9c9-db54-40fa-a7c0-a04a5ea7531e" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/providers/Microsoft.Authorization/roleDefinitions/9980e02c-c2be-4d73-94e8-173b1dc7cf3c" -> null
      - role_definition_name = "Virtual Machine Contributor" -> null
      - scope                = "/providers/Microsoft.Management/managementGroups/Security" -> null
    }

Plan: 9 to add, 0 to change, 9 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":51,"Program":"tfcmt","SHA1":"","Target":"prod_app_registrations","Vars":{}} -->